# MacroModuleIterator Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MacroModuleIterator Class
Members See Also
---
An iterator to the Macros in a MacroModule.
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class MacroModuleIterator : IEnumerator<Macro>
```

Visual Basic
---
```text
Public Class MacroModuleIterator _
	Implements IEnumerator(Of Macro)
```

Visual C++
---
```text
public ref class MacroModuleIterator : IEnumerator<Macro^>
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Macros..::..MacroModuleIterator
# See Also
MacroModuleIterator Members
Autodesk.Revit.DB.Macros Namespace